# groupby 결과(멀티 인덱스)를 데이터프레임 형식으로 변환

[참고자료](http://daplus.net/python-series%EC%97%90%EC%84%9C-dataframe%EC%9C%BC%EB%A1%9C-pandas-groupby-%EC%B6%9C%EB%A0%A5-%EB%B3%80%ED%99%98/)

In [20]:
import pandas as pd

In [21]:
df1 = pd.DataFrame({"Name":["Alice", "Bob", "Mallory", "Mallory", "Bob" , "Mallory"],
                    "City":["Seattle","Seattle","Portland","Seattle","Seattle","Portland"]})
df1

      Name      City
0    Alice   Seattle
1      Bob   Seattle
2  Mallory  Portland
3  Mallory   Seattle
4      Bob   Seattle
5  Mallory  Portland

In [22]:
g1 = df1.groupby( [ "Name", "City"] )[[ "Name", "City"]].count()
g1

                  Name  City
Name    City
Alice   Seattle      1     1
Bob     Seattle      2     2
Mallory Portland     2     2
        Seattle      1     1

In [23]:
g1.add_suffix('_Count').reset_index()

      Name      City  Name_Count  City_Count
0    Alice   Seattle           1           1
1      Bob   Seattle           2           2
2  Mallory  Portland           2           2
3  Mallory   Seattle           1           1